#+TITLE: Week 4.7 Math Homework
#+AUTHOR: 2024110144 陈有骏
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{xeCJK}
#+OPTIONS: \n:t toc:nil num:nil date:nil

#+begin_comment
4.7 done
thomas 15.6 1-20 mod 3
4.9 done
thomas 15.5 1-52 mod 5
4.11
thomas 15.7 1-66 mod 6
thomas 15.8 1-28 mod 7
#+end_comment

** 30
$$\begin{align*}
\int_0^2 \int_0^{4-x^2} \int_0^{4-x^2-y} dzdydx
&= \int_0^2 \int_0^{4-x^2} 4-x^2-y dydx\\
&= \int_0^2 4y- x^2 y - \frac{y^2}{2} |_0^{4-x^2} dx\\
&= \int_0^2 \frac{(4-x^2)^2}{2} dx\\
&= \int_0^2 \frac{x^4-8x^2+16}{2} dx\\
&= \int_0^2 \frac{x^4}{2}-4x^2+8 dx\\
&= \frac{x^5}{10}-\frac{4x^3}{3}+8x |_0^2\\
&= \frac{16}{5}-\frac{32}{3}+16\\
&= \frac{16}{5}-\frac{32}{3}+16\\
&= \frac{128}{15}
\end{align*}$$
#+begin_src scheme :exports both
  (+ 16/5 (- 32/3) 16)
#+end_src

#+RESULTS:
: 128/15

** 50
the triple integral is
$$\int_0^1 \int_{-\sqrt{z}}^{\sqrt{z}} \int_{-\sqrt{z-y^2}}^{\sqrt{z-y^2}} |xyz| dxdydz$$
#+begin_src python :python "python3" :results output :exports both
  from math import sqrt
  from scipy.integrate import tplquad

  result = tplquad (lambda x,y,z: abs(x*y*z), 0, 1, lambda z: -sqrt(z), lambda z: sqrt(z), lambda z,y: -sqrt(z-y**2), lambda z,y: sqrt(z-y**2))
  print(result)
#+end_src

#+RESULTS:
: (0.12499999999999997, 5.523359547510154e-15)
so the integral is $0.125$

